<?php
# Положительное число
    $a = 100;
    $b = 300;
    $d = $a/$b;
    if ($d > 0) {
	echo "Число d = ".$d."\n";
    } else if ($d == 0) {
	echo "Число d равно 0\n";
    } else {
	echo "Число d отрицательное\n";
    };

# Отрицательное число
    $a = 0;
    $b = -400;
    $d = $a/$b;
    if ($d > 0) {
	echo "Число d = ".$d."\n";
    } else if ($d == 0) {
	echo "Число d равно 0\n";
    } else {
	echo "Число d отрицательное\n";
    };

# Число 0
    $a = 10;
    $b = -300;
    $d = $a/$b;
    if ($d > 0) {
	echo "Число d = ".$d."\n";
    } else if ($d == 0) {
	echo "Число d равно 0\n";
    } else {
	echo "Число d отрицательное\n";
    };
?>
